{
  "dhp1:0.3": "These verses are about or spoken by different people in the suttas. Each verse is self-contained and a complete teaching in itself.",
  "dhp1:1": "\"Mano\" is translated as \"you\" to convey the immediacy that other renderings like \"mind,\" \"one,\" or \"intention\" lack. \"Citta\" is a distinct concept, referring to the “heart-mind”, “wild animal”, or “inner child”, while \"mano\" here represents the volitional agent—\"you\"—directly responsible for actions.\n\n\"Dhammā\" here encompasses multiple meanings: the teachings as understood by you, the mental states arising from your actions, and you within the context of the way things are.",
  "dhp1:3": "Both \"manasā\" (by means of mano) and \"paduṭṭhena\" (by means of contamination) are in the instrumental case, and the verse states \"speaks\" (bhāsati) or \"acts\" (karoti) with no other agent. Thus, mano—\"you\"—is the actor. The contamination (\"paduṭṭhena\") modifies the means of action (\"manasā\"), meaning through action, contamination from past actions maintains ill-being.",
  "dhp1:4": "Dukkha (ill-being, unsatisfactoriness) and sukha (well-being, satisfaction) describe more than just emotions. They refer to the overall quality of one's experiential “space'” (kha), akin to the open “space” of the sky. The prefix \"du\" is negative, meaning \"bad\" or \"difficult\". Thus, dukkha indicates a constricted or unsatisfactory state of existence. The prefix “su” is positive, meaning “well” or “excellent”. This “space” (kha) encompasses the “being” in “well-being” and “ill-being,” indicating the totality of one's state of existence.\n\nContamination itself does not force action; acting out is still on you. Rather, contamination is a state arising from past unwholesome actions. If one acts out with this contaminated state, further ill-being inevitably follows.",
  "dhp1:6": "The verse compares \"speak or act\" to \"footsteps,\" emphasizing that ill-being is a result of one's actions, not a random occurrence. This aligns with the principle that \"beings are owners of their actions.\"",
  "dhp3:3": "The Pali word taṁ means \"that,\" and the verb upanayhanti means \"to carry, to hold, to harbor.\" Translating literally as “hold onto that” doesn’t convey the same sense of the resentment’s weight hence “bear this burden”. This also parallels “discard this burden”.",
  "dhp5:3": "This line employs subtle wordplay. In the preceding line, sammantīdha (\"are appeased here\") refers to the hostilities. Here, sammanti (\"are appeased\") lacks an explicit subject. Sammanti implies two subjects \"oneself is appeased\" and \"hostiles are appeased\".",
  "dhp6:2": "Yamāmase is the middle voice of yamati, “to die,” and the suffix -mase brings it sharply to the right here, right now. Hence “perishing” highlights the continuous presence of death with all life.",
  "dhp7:0": "Attributed to Elder Mahākāḷa, these verses encapsulate core elements of the noble disciple’s practice. A deep understanding of each Pali word is a mark of one \"well-learned and skilled in the way of the noble disciples\" (sutavā ariyasāvako).",
  "dhp10:0": "These verses describe a sotapanna, one established in virtue, restraint, and truthfulness. They have “disgorged” (vanta-), or forcefully expelled, the majority of their defilements (kasāva), like one vomiting a poisonous meal. This expulsion requires effort and a clear understanding of the urgent need to abandon defilements. However, a sotapanna hasn't eradicated all traces of the root defilements (kilesas), such as passion (rāga), thus they are not yet an arahant. This highlights that establishment in virtue is unattainable without first significantly reducing one's defilements.",
  "dhp12:1": "Sāra was translated as \"necessary\" rather than “essential” to bridge its meaning of \"essential\" with the practical understanding of what is truly important. Discerning the \"necessary\" requires understanding a thing's essential nature. This is inherent in sammādiṭṭhi (proper view), which is the foundation the rest of the eightfold noble path.",
  "dhp12:2": "This illustrates micchādiṭṭhi (improper view), where one holds opinions without genuine understanding. Proper understanding comes from grasping the Dhamma directly.",
  "dhp12:3": "\"Sammā\" and \"micchā\" were translated as \"proper\" and \"improper\" instead of \"right\" and \"wrong.\" This shifts the focus from moral judgment to the effectiveness of the path. \"Proper\" implies that if something is done correctly according to the Buddha's teachings, it yields the promised results—the attainments.\n\n“Necessary” here refers to the ending of ill-being (dukkha) and the means of true well-being (sukha).",
  "dhp13:3": "“Mind” here means “citta”, not mental faculty, “mano”. It’s the “citta” that is soaked with passion, not phenomena.",
  "dhp15:4": "Translating “disvā” as “seeing” is too literal and implies that one is understanding their defiled actions, which is not necessarily true. “Disvā” is more like “found out”, “experiencing”, or “encountering”.\n\nI have added “he has” to draw attention to the clever use of the verb “disvā”. He experiences lamentation or gladness, in the same way one has “found” the result of their actions.",
  "dhp19:2": "“Naro pamatto” (negligent man) is put after “na takkaro hoti” (not doing what was recited), to emphasize the quality of negligence within that man. Pali is flexible with word order, but this is where the unusual word order matters for emphasis."
}