{
  "mn3:0.1": "Middle Length Discourses 3 ",
  "mn3:0.2": "The Discourse on Heirs of the Dhamma  ",
  "mn3:1.1": "Thus have I heard.",
  "mn3:1.2": "At one time the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery. ",
  "mn3:1.3": "There the Blessed One addressed the monks: ",
  "mn3:1.4": "\"Monks!\" ",
  "mn3:1.5": "\"Venerable Sir,\" those monks replied to the Blessed One. ",
  "mn3:1.6": "The Blessed One said this: ",
  "mn3:2.1": "\"Be heirs of the Dhamma, monks, not heirs of material things. ",
  "mn3:2.2": "There is compassion in me for you: ",
  "mn3:2.3": "'How can my disciples be heirs of the Dhamma, not heirs of material things?' ",
  "mn3:2.4": "If you, monks, were to be heirs of material things and not heirs of the Dhamma, you would be liable to reproach: ",
  "mn3:2.5": "'The Teacher's disciples live as heirs of material things, not as heirs of the Dhamma'; ",
  "mn3:2.6": "I too would be liable to reproach: ",
  "mn3:2.7": "'The Teacher's disciples live as heirs of material things, not as heirs of the Dhamma.' ",
  "mn3:2.8": "And you, monks, should be heirs of the Dhamma, not heirs of material things. You too would not be liable to reproach: ",
  "mn3:2.9": "'The Teacher's disciples live as heirs of the Dhamma, not as heirs of material things'; ",
  "mn3:2.10": "nor would I be liable to reproach: ",
  "mn3:2.11": "'The Teacher's disciples live as heirs of the Dhamma, not as heirs of material things.' ",
  "mn3:2.12": "Therefore, monks, be heirs of the Dhamma, not heirs of material things. ",
  "mn3:2.13": "There is compassion in me for you: ",
  "mn3:2.14": "'How can my disciples be heirs of the Dhamma, not heirs of material things?'\" ",
  "mn3:3.1": "Here, monks, I suppose I have eaten, satisfied, full, done, content, and having had enough; ",
  "mn3:3.2": "and there is my leftover alms-food that should be discarded. ",
  "mn3:3.3": "Then two monks come, overcome by hunger and weakness. ",
  "mn3:3.4": "Then I would say to them: ",
  "mn3:3.5": "\"Monks, I have eaten, satisfied, full, done, content, and having had enough; ",
  "mn3:3.6": "and there is my leftover alms-food that should be discarded. ",
  "mn3:3.7": "If you wish, eat it; if you do not eat it, I will discard it in a barren place or pour it into water where no living beings dwell.' ",
  "mn3:3.8": "Then one of the monks might think: ",
  "mn3:3.9": "'The Blessed One has eaten, is satisfied, full, done, content, and having had enough; ",
  "mn3:3.10": "and there is Blessed One's leftover alms-food that should be discarded. ",
  "mn3:3.11": "If we do not eat it, the Blessed One will discard it in a barren place or pour it into water where no living beings dwell. ",
  "mn3:3.12": "It has been said by the Blessed One: ",
  "mn3:3.13": "\"Monks, be heirs of the Dhamma, not heirs of material things.\" ",
  "mn3:3.14": "And this alms-food is a material thing in particular. ",
  "mn3:3.15": "What if I were to not eat this alms-food and endure the day and night with this hunger and weakness? ",
  "mn3:3.16": "Then, without eating that alms-food, he would endure the day and night with that hunger and weakness? ",
  "mn3:3.17": "Then another monk might think: ",
  "mn3:3.18": "'The Blessed One has eaten, is satisfied, full, done, content, and having had enough; ",
  "mn3:3.19": "and there is the Blessed One's leftover alms-food that should be discarded. ",
  "mn3:3.20": "If we do not eat it, the Blessed One will discard it in a barren place or pour it into water where no living beings dwell. ",
  "mn3:3.21": "What if I were to eat this alms-food and then spend the day and night, having dispelled this hunger and weakness? ",
  "mn3:3.22": "Then, having eaten that alms-food, he would spend the day and night having dispelled that hunger and weakness. ",
  "mn3:3.23": "Even though that monk, having eaten that alms-food, would pass the day and night having dispelled that hunger and weakness, that earlier monk is still more worthy of respect and praise to me. ",
  "mn3:3.24": "And why is that? ",
  "mn3:3.25": "Because, monks, that (earlier) monk will lead to long-term fewness of wishes, contentment, erasure (of defilements), ease of support, and diligent effort. ",
  "mn3:3.26": "Therefore, monks, be heirs of the Dhamma, not heirs of material things. ",
  "mn3:3.27": "There is compassion in me for you: ",
  "mn3:3.28": "'How can my disciples be heirs of the Dhamma, not heirs of material things?' "
}